app/views/ideas/_form.html.erb

SELECT "roles".* FROM "roles"
---

    <% for role in Role.all  %>