app/views/ideas/index.html.erb

        <td>
        <% for i in 0..idea.role.length-1 %>
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 1]]