app/controllers/ideas_controller.rb

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "skills", "add_information", "platform_id", "user_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "platform_id" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["platform_id", 1], ["updated_at", "2016-04-21 13:01:14.326476"], ["id", 10]]