app/controllers/platforms_controller.rb

  def index
    @platforms = Platform.all
---
SELECT "platforms".* FROM "platforms"

  def create
    @platform = Platform.new(platform_params)

    respond_to do |format|
      if @platform.save
---
INSERT INTO "platforms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "IOS"], ["created_at", "2016-04-21 10:24:47.782076"], ["updated_at", "2016-04-21 10:24:47.782076"]]

    def set_platform
      @platform = Platform.find(params[:id])
---
SELECT  "platforms".* FROM "platforms" WHERE "platforms"."id" = ? LIMIT 1  [["id", 1]]