app/controllers/roles_controller.rb

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Designer"], ["created_at", "2016-04-21 10:24:28.067926"], ["updated_at", "2016-04-21 10:24:28.067926"]]
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save