app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "role_id", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_digest" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$c0wS4MWaVcuJ7FPlNznkAORWjcrUDoHdNXDbUIaBztV5oYOfudQbm"], ["admin", "t"], ["updated_at", "2016-04-21 16:37:11.887881"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)